eisup_2019_docmng_integration/src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавокЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделениеЗавершения</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизацииЗавершения</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьЗавершения</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботыЗавершения</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостоянияЗавершения</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <attributes>
    <name>УдалитьТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.УвольнениеИзОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьФизлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПриказ</name>
    <type>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ПричиныНетрудоспособности/ПричиныНетрудоспособности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныНетрудоспособности</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОбщееЗаболевание</name>
  </enumValues>
  <enumValues>
    <name>ПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ТравмаНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТравмаВБыту</name>
  </enumValues>
  <enumValues>
    <name>ПособиеБезЗаболевания</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо3хЛет</name>
    <comment>Оплачивается по стажу весь б/л</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетДляСостоящихВБраке</name>
    <comment>Оплачивается весь б/л, но через неделю - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетДляНеСостоящихВБраке</name>
    <comment>Оплачивается весь б/л, но через 10 дней - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетДляСостоящихВБраке</name>
    <comment>Оплачивается две недели, вторая - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетДляНеСостоящихВБраке</name>
    <comment>Оплачивается две недели, с 11-го дня - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаВзрослым</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Протезирование</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриДолечивании</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СостоянияРаботникаОрганизации/СостоянияРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРаботникаОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>НеРаботает</name>
  </enumValues>
  <enumValues>
    <name>Заболевание</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускЕжегодный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетПоНевыясненнойПричине</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныеОбязанности</name>
  </enumValues>
  <enumValues>
    <name>Прогулы</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>ТравмаНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаВзрослым</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Протезирование</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриДолечивании</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СпособыРегистрацииВремени/СпособыРегистрацииВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРегистрацииВремени</name>
  <comment>(Общ) Предназначено для указания способа регистрации времени разовых начислений и невыходов (целосменный или часовой)</comment>
  <enumValues>
    <name>РегистрацияДляЦелойСмены</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияДляЧастиСмены</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ПорядокРасчетаОтпуска/ПорядокРасчетаОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетаОтпуска</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ПоШестидневке</name>
  </enumValues>
  <enumValues>
    <name>ПоКалендарнымДням</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СлучаиУходаЗаБольнымиДетьми/СлучаиУходаЗаБольнымиДетьми.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СлучаиУходаЗаБольнымиДетьми</name>
  <comment>(регл)</comment>
  <enumValues>
    <name>ПоУходуДо3хЛет</name>
    <comment>Оплачивается по стажу весь б/л, до 31.12.2006 г.</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетДляСостоящихВБраке</name>
    <comment>Оплачивается весь б/л, но через неделю - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетДляНеСостоящихВБраке</name>
    <comment>Оплачивается весь б/л, но через 10 дней - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетДляСостоящихВБраке</name>
    <comment>Оплачивается две недели, вторая - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетДляНеСостоящихВБраке</name>
    <comment>Оплачивается две недели, с 11-го дня - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетАмбулаторно</name>
    <comment>с 1.1.2007</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетВСтационаре</name>
    <comment>с 1.1.2007</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетАмбулаторно</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетВСтационаре</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенкомИнвалидомАмбулаторно</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенкомИнвалидомВСтационаре</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетПриВИЧ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыОграниченияПособия/ВидыОграниченияПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОграниченияПособия</name>
  <enumValues>
    <name>ОбщееОграничение</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеВРазмереММОТ</name>
  </enumValues>
  <enumValues>
    <name>БезОграничений</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыПростояРаботника/ВидыПростояРаботника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПростояРаботника</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ПоНезависящимПричинам</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/КлассификаторИспользованияРабочегоВремени/КлассификаторИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторИспользованияРабочегоВремени</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ВыходныеДни</name>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Бер-ть</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>ДОтпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забасто</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержк</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Ком-ка</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки </description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Обяз-ти</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>ПоУходу</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Прогул</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Работа</name>
      <description>Работа </description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Работа</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/АнализНеявокПереопределяемый/Module.bsl
Функция ВернутьТекстВТСписокРасчетныхДокументов() Экспорт
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БольничныйЛист.Сотрудник КАК Сотрудник,
	|	БольничныйЛист.Сотрудник.Физлицо КАК Физлицо,
	|	БольничныйЛист.ДатаНачала,
	|	БольничныйЛист.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ТравмаНаПроизводстве)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве)
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаРебенком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком)
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаВзрослым)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым)
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.Карантин)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Карантин)
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.Протезирование)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Протезирование)
	|		КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПособиеПриДолечивании)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечивании)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
	|	КОНЕЦ КАК Состояние,
	|	БольничныйЛист.Ссылка КАК РасчетныйДокумент,
	|	БольничныйЛист.ВидРасчета КАК ВидРасчета,
	|	NULL КАК ПорядокРасчетаОтпуска,
	|	NULL КАК ВидДополнительногоОтпуска,
	|	NULL КАК ДатаНачалаДоп,
	|	NULL КАК РабочийГодС,
	|	NULL КАК РабочийГодПо,
	|	БольничныйЛист.ПричинаНетрудоспособности,
	|	БольничныйЛист.СлучайУходаЗаБольнымРебенком,
	|	БольничныйЛист.ДнейОплаты,
	|	БольничныйЛист.ДатаНарушенияРежима,
	|	БольничныйЛист.ПроцентОплаты,
	|	БольничныйЛист.ПервичныйБольничныйЛист,
	|	БольничныйЛист.ОграничениеПособия,
	|	БольничныйЛист.НомерВходящегоДокумента,
	|	БольничныйЛист.СерияВходящегоДокумента,
	|	NULL КАК ВидПростоя,
	|	ВЫБОР
	|		КОГДА БольничныйЛист.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА БольничныйЛист.Организация
	|		ИНАЧЕ БольничныйЛист.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	БольничныйЛист.ДатаНачалаСобытия,
	|	БольничныйЛист.ДатаНачалаОплаты,
	|	БольничныйЛист.ЯвляетсяПродолжениемБолезни,
	|	БольничныйЛист.ПериодРегистрации
	|ПОМЕСТИТЬ ВТСписокРасчетныхДокументов
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту КАК БольничныйЛист
	|ГДЕ
	|	(&ОтбиратьСобытияПоДокументу
	|			ИЛИ БольничныйЛист.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ))
	|	И (&НеОтбиратьПоОрганизации
	|			ИЛИ БольничныйЛист.Организация В (&СписокОрганизаций))
	|	И (НЕ БольничныйЛист.ПометкаУдаления)
	|	И ((НЕ &ОтбиратьСобытияПоДокументу)
	|			ИЛИ (БольничныйЛист.Сотрудник, ВЫБОР
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ТравмаНаПроизводстве)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве)
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаРебенком)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком)
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаВзрослым)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым)
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.Карантин)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Карантин)
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.Протезирование)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Протезирование)
	|				КОГДА БольничныйЛист.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПособиеПриДолечивании)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечивании)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
	|			КОНЕЦ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТСостояниеРаботников.Сотрудник,
	|					ВТСостояниеРаботников.Состояние
	|				ИЗ
	|					ВТСостояниеРаботников КАК ВТСостояниеРаботников))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НевыходыНачисления.Сотрудник,
	|	НевыходыНачисления.Сотрудник.Физлицо,
	|	НевыходыНачисления.ДатаНачала,
	|	НевыходыНачисления.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты)
	|		КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый)
	|		КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
	|		КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
	|	КОНЕЦ,
	|	НевыходыНачисления.Ссылка,
	|	НевыходыНачисления.ВидРасчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА НевыходыНачисления.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НевыходыНачисления.Ссылка.Организация
	|		ИНАЧЕ НевыходыНачисления.Ссылка.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НевыходыНачисления.Ссылка.ПериодРегистрации
	|ИЗ
	|	Документ.НевыходыВОрганизациях.Начисления КАК НевыходыНачисления
	|ГДЕ
	|	(&ОтбиратьСобытияПоДокументу
	|			ИЛИ НевыходыНачисления.Ссылка.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ))
	|	И (&НеОтбиратьПоОрганизации
	|			ИЛИ НевыходыНачисления.Ссылка.Организация В (&СписокОрганизаций))
	|	И (НЕ НевыходыНачисления.Ссылка.ПометкаУдаления)
	|	И ((НЕ &ОтбиратьСобытияПоДокументу)
	|			ИЛИ (НевыходыНачисления.Сотрудник, ВЫБОР
	|				КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя))
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты)
	|				КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый)
	|				КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
	|				КОГДА НевыходыНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
	|			КОНЕЦ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТСостояниеРаботников.Сотрудник,
	|					ВТСостояниеРаботников.Состояние
	|				ИЗ
	|					ВТСостояниеРаботников КАК ВТСостояниеРаботников))
	|	И НевыходыНачисления.Ссылка.СпособРегистрацииВремени = ЗНАЧЕНИЕ(Перечисление.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеОтпуска.Сотрудник,
	|	НачислениеОтпуска.Сотрудник.Физлицо,
	|	ВЫБОР
	|		КОГДА НачислениеОтпуска.ДатаНачалаОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НачислениеОтпуска.ДатаНачалаОсновногоОтпуска
	|		ИНАЧЕ НачислениеОтпуска.ДатаНачалаДополнительногоОтпуска
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеОтпуска.ДатаОкончанияОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НачислениеОтпуска.ДатаОкончанияОсновногоОтпуска
	|		ИНАЧЕ НачислениеОтпуска.ДатаОкончанияДополнительногоОтпуска
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеОтпуска.ДатаНачалаОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|		КОГДА НачислениеОтпуска.ВидРасчетаДополнительногоОтпуска.ОбозначениеВТабелеУчетаРабочегоВремени В (ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|	КОНЕЦ,
	|	НачислениеОтпуска.Ссылка,
	|	ВЫБОР
	|		КОГДА НачислениеОтпуска.ДатаНачалаОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеОтпуска.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка)
	|				КОНЕЦ
	|		ИНАЧЕ НачислениеОтпуска.ВидРасчетаДополнительногоОтпуска
	|	КОНЕЦ,
	|	НачислениеОтпуска.ПорядокРасчетаОсновногоОтпуска,
	|	НачислениеОтпуска.ВидРасчетаДополнительногоОтпуска,
	|	НачислениеОтпуска.ДатаНачалаДополнительногоОтпуска,
	|	НачислениеОтпуска.РабочийГодС,
	|	НачислениеОтпуска.РабочийГодПо,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НачислениеОтпуска.ПроцентОплатыДополнительногоОтпуска,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА НачислениеОтпуска.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачислениеОтпуска.Организация
	|		ИНАЧЕ НачислениеОтпуска.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	НачислениеОтпуска.ДатаНачалаСобытия,
	|	NULL,
	|	NULL,
	|	НачислениеОтпуска.ПериодРегистрации
	|ИЗ
	|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпуска
	|ГДЕ
	|	(&ОтбиратьСобытияПоДокументу
	|			ИЛИ НачислениеОтпуска.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ))
	|	И (&НеОтбиратьПоОрганизации
	|			ИЛИ НачислениеОтпуска.Организация В (&СписокОрганизаций))
	|	И (НЕ НачислениеОтпуска.ПометкаУдаления)
	|	И ((НЕ &ОтбиратьСобытияПоДокументу)
	|			ИЛИ (НачислениеОтпуска.Сотрудник, ВЫБОР
	|				КОГДА НачислениеОтпуска.ДатаНачалаОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|				КОГДА НачислениеОтпуска.ВидРасчетаДополнительногоОтпуска.ОбозначениеВТабелеУчетаРабочегоВремени В (ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации), ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение))
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|			КОНЕЦ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТСостояниеРаботников.Сотрудник,
	|					ВТСостояниеРаботников.Состояние
	|				ИЗ
	|					ВТСостояниеРаботников КАК ВТСостояниеРаботников))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаПоСреднему.Сотрудник,
	|	ОплатаПоСреднему.Сотрудник.Физлицо,
	|	ОплатаПоСреднему.ДатаНачала,
	|	ОплатаПоСреднему.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
	|		КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВынужденныйПрогул)
	|		КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
	|		КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые)
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ОплатаПоСреднему.Ссылка,
	|	ОплатаПоСреднему.ВидРасчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ОплатаПоСреднему.ПроцентОплаты,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднему.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОплатаПоСреднему.Организация
	|		ИНАЧЕ ОплатаПоСреднему.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ОплатаПоСреднему.ПериодРегистрации
	|ИЗ
	|	Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднему
	|ГДЕ
	|	(&ОтбиратьСобытияПоДокументу
	|			ИЛИ ОплатаПоСреднему.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ))
	|	И (&НеОтбиратьПоОрганизации
	|			ИЛИ ОплатаПоСреднему.Организация В (&СписокОрганизаций))
	|	И (НЕ ОплатаПоСреднему.ПометкаУдаления)
	|	И ОплатаПоСреднему.СпособРегистрацииВремени = ЗНАЧЕНИЕ(Перечисление.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены)
	|	И ((НЕ &ОтбиратьСобытияПоДокументу)
	|			ИЛИ (ОплатаПоСреднему.Сотрудник, ВЫБОР
	|				КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
	|				КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВынужденныйПрогул)
	|				КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
	|				КОГДА ОплатаПоСреднему.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые)
	|				ИНАЧЕ NULL
	|			КОНЕЦ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТСостояниеРаботников.Сотрудник,
	|					ВТСостояниеРаботников.Состояние
	|				ИЗ
	|					ВТСостояниеРаботников КАК ВТСостояниеРаботников))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрацияПростоев.Сотрудник,
	|	РегистрацияПростоев.Сотрудник.Физлицо,
	|	РегистрацияПростоев.ДатаНачала,
	|	РегистрацияПростоев.ДатаОкончания,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой),
	|	РегистрацияПростоев.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	РегистрацияПростоев.ВидПростоя,
	|	ВЫБОР
	|		КОГДА РегистрацияПростоев.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РегистрацияПростоев.Организация
	|		ИНАЧЕ РегистрацияПростоев.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	РегистрацияПростоев.ПериодРегистрации
	|ИЗ
	|	Документ.РегистрацияПростоевРаботниковОрганизаций КАК РегистрацияПростоев
	|ГДЕ
	|	(&ОтбиратьСобытияПоДокументу
	|			ИЛИ РегистрацияПростоев.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ))
	|	И (&НеОтбиратьПоОрганизации
	|			ИЛИ РегистрацияПростоев.Организация В (&СписокОрганизаций))
	|	И (НЕ РегистрацияПростоев.ПометкаУдаления)
	|	И РегистрацияПростоев.СпособРегистрацииВремени = ЗНАЧЕНИЕ(Перечисление.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены)
	|	И ((НЕ &ОтбиратьСобытияПоДокументу)
	|			ИЛИ (РегистрацияПростоев.Сотрудник, ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТСостояниеРаботников.Сотрудник,
	|					ВТСостояниеРаботников.Состояние
	|				ИЗ
	|					ВТСостояниеРаботников КАК ВТСостояниеРаботников))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	
КонецФункции

Функция ВернутьТекстОсновногоЗапроса() Экспорт
	
	Возврат
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетныеИКадровыеДанные.Отметка,
	|	РасчетныеИКадровыеДанные.Сотрудник,
	|	РасчетныеИКадровыеДанные.СотрудникНаименование КАК СотрудникНаименование,
	|	РасчетныеИКадровыеДанные.Физлицо,
	|	РасчетныеИКадровыеДанные.ДатаНачала КАК ДатаНачала,
	|	РасчетныеИКадровыеДанные.ДатаОкончания,
	|	РасчетныеИКадровыеДанные.Неявка КАК Неявка,
	|	РасчетныеИКадровыеДанные.КадровыйДокумент КАК КадровыйДокумент,
	|	ВЫБОР
	|		КОГДА РасчетныеИКадровыеДанные.РасчетныйДокумент ЕСТЬ НЕ NULL 
	|			ТОГДА РасчетныеИКадровыеДанные.РасчетныйДокумент
	|		КОГДА РасчетныеИКадровыеДанные.Неявка В (ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечивании), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Протезирование), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Карантин), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком))
	|			ТОГДА ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка В (ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный))
	|			ТОГДА ЗНАЧЕНИЕ(Документ.НачислениеОтпускаРаботникамОрганизаций.ПустаяСсылка)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка В (ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВынужденныйПрогул), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые))
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ОплатаПоСреднемуЗаработку.ПустаяСсылка)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.РегистрацияПростоевРаботниковОрганизаций.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.НевыходыВОрганизациях.ПустаяСсылка)
	|	КОНЕЦ КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА РасчетныеИКадровыеДанные.РасчетныйДокумент ЕСТЬ НЕ NULL 
	|			ТОГДА РасчетныеИКадровыеДанные.ВидРасчета
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка В (ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечивании), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Протезирование), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Карантин), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание))
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
	|			ТОГДА ПВРКомандировка.ВидРасчета
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|			ТОГДА NULL
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
	|			ТОГДА ПВРОтпускУчебный.ВидРасчета
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Невыход)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВынужденныйПрогул)
	|			ТОГДА ПВРВынужденныйПрогул.ВидРасчета
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
	|			ТОГДА ПВРГосударственныеОбязанности.ВидРасчета
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаВыходныхДнейПоУходуЗаДетьмиИнвалидами)
	|		КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
	|			ТОГДА NULL
	|	КОНЕЦ КАК ВидРасчета,
	|	РасчетныеИКадровыеДанные.ПорядокРасчетаОтпуска,
	|	РасчетныеИКадровыеДанные.ВидДополнительногоОтпуска,
	|	РасчетныеИКадровыеДанные.ДатаНачалаДоп,
	|	РасчетныеИКадровыеДанные.РабочийГодС,
	|	РасчетныеИКадровыеДанные.РабочийГодПо,
	|	РасчетныеИКадровыеДанные.ПричинаНетрудоспособности,
	|	РасчетныеИКадровыеДанные.ПроцентОплаты,
	|	РасчетныеИКадровыеДанные.ПервичныйБольничныйЛист,
	|	РасчетныеИКадровыеДанные.ОграничениеПособия,
	|	РасчетныеИКадровыеДанные.СлучайУходаЗаБольнымРебенком,
	|	РасчетныеИКадровыеДанные.ДатаНачалаСобытия,
	|	РасчетныеИКадровыеДанные.ДатаНачалаОплаты,
	|	РасчетныеИКадровыеДанные.ЯвляетсяПродолжениемБолезни,
	|	ВЫБОР
	|		КОГДА РасчетныеИКадровыеДанные.РасчетныйДокумент ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетныеИКадровыеДанные.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПособиеПриДолечивании)
	|						ТОГДА ВЫБОР
	|								КОГДА РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) < 0
	|									ТОГДА 0
	|								КОГДА РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) > 24
	|									ТОГДА 24
	|								ИНАЧЕ РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)
	|							КОНЕЦ
	|					КОГДА РасчетныеИКадровыеДанные.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаВзрослым)
	|						ТОГДА ВЫБОР
	|								КОГДА РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) < 0
	|									ТОГДА 0
	|								КОГДА РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) > 7
	|									ТОГДА 7
	|								ИНАЧЕ РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)
	|							КОНЕЦ
	|					КОГДА РасчетныеИКадровыеДанные.СлучайУходаЗаБольнымРебенком В (ЗНАЧЕНИЕ(Перечисление.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетАмбулаторно), ЗНАЧЕНИЕ(Перечисление.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетВСтационаре))
	|						ТОГДА ВЫБОР
	|								КОГДА РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) < 0
	|									ТОГДА 0
	|								КОГДА РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) > 15
	|									ТОГДА 15
	|								ИНАЧЕ РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)
	|							КОНЕЦ
	|					ИНАЧЕ РАЗНОСТЬДАТ(РасчетныеИКадровыеДанные.ДатаНачала, ДОБАВИТЬКДАТЕ(РасчетныеИКадровыеДанные.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)
	|				КОНЕЦ
	|		ИНАЧЕ РасчетныеИКадровыеДанные.ДнейОплаты
	|	КОНЕЦ КАК ДнейОплаты,
	|	РасчетныеИКадровыеДанные.ДатаНарушенияРежима,
	|	РасчетныеИКадровыеДанные.НомерВходящегоДокумента,
	|	РасчетныеИКадровыеДанные.СерияВходящегоДокумента,
	|	РасчетныеИКадровыеДанные.ВидПростоя,
	|	РасчетныеИКадровыеДанные.Организация,
	|	РасчетныеИКадровыеДанные.ОрганизацияНаименование,
	|	ЕСТЬNULL(РасчетныеИКадровыеДанные.РасчетныеДанныеПериодРегистрации, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетныеИКадровыеДанные.Сотрудник КАК Сотрудник,
	|		РасчетныеИКадровыеДанные.СотрудникНаименование КАК СотрудникНаименование,
	|		РасчетныеИКадровыеДанные.СотрудникВидДоговора КАК СотрудникВидДоговора,
	|		РасчетныеИКадровыеДанные.Неявка КАК Неявка,
	|		РасчетныеИКадровыеДанные.ДатаНачала КАК ДатаНачала,
	|		ВЫБОР
	|			КОГДА МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныйДокумент) ЕСТЬ НЕ NULL 
	|					И МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныйДокументПроведен) = ИСТИНА
	|				ТОГДА ЛОЖЬ
	|			КОГДА МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыйДокумент) ЕСТЬ НЕ NULL 
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК Отметка,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыеДанныеФизЛицо), МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеФизЛицо)) КАК Физлицо,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыеДанныеДатаОкончания), МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеДатаОкончания)) КАК ДатаОкончания,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыйДокумент) КАК КадровыйДокумент,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныйДокумент) КАК РасчетныйДокумент,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныйДокументПроведен) КАК РасчетныйДокументПроведен,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ВидРасчета) КАК ВидРасчета,
	|		ВЫБОР
	|			КОГДА МАКСИМУМ(РасчетныеИКадровыеДанные.ПорядокРасчетаОтпуска) ЕСТЬ НЕ NULL 
	|				ТОГДА МАКСИМУМ(РасчетныеИКадровыеДанные.ПорядокРасчетаОтпуска)
	|			КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК ПорядокРасчетаОтпуска,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеВидДополнительногоОтпуска), МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыеДанныеВидДополнительногоОтпуска)) КАК ВидДополнительногоОтпуска,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеДатаНачалаДоп), МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыеДанныеДатаНачалаДоп)) КАК ДатаНачалаДоп,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеРабочийГодС), МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыеДанныеРабочийГодС)) КАК РабочийГодС,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеРабочийГодПо), МАКСИМУМ(РасчетныеИКадровыеДанные.КадровыеДанныеРабочийГодПо)) КАК РабочийГодПо,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.ПричинаНетрудоспособности), ВЫБОР
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ОбщееЗаболевание)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ТравмаНаПроизводстве)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаРебенком)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоУходуЗаВзрослым)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Карантин)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.Карантин)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Протезирование)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.Протезирование)
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечивании)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПособиеПриДолечивании)
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ПричинаНетрудоспособности,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.ПроцентОплаты), 100) КАК ПроцентОплаты,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ПервичныйБольничныйЛист) КАК ПервичныйБольничныйЛист,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.СлучайУходаЗаБольнымРебенком), ВЫБОР
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетАмбулаторно)
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК СлучайУходаЗаБольнымРебенком,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ДнейОплаты) КАК ДнейОплаты,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ДатаНарушенияРежима) КАК ДатаНарушенияРежима,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.ОграничениеПособия), ВЫБОР
	|				КОГДА РасчетныеИКадровыеДанные.Неявка В (ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам))
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОграниченияПособия.ОбщееОграничение)
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ОграничениеПособия,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.НомерВходящегоДокумента) КАК НомерВходящегоДокумента,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.СерияВходящегоДокумента) КАК СерияВходящегоДокумента,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ДатаНачалаСобытия) КАК ДатаНачалаСобытия,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ДатаНачалаОплаты) КАК ДатаНачалаОплаты,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.ЯвляетсяПродолжениемБолезни) КАК ЯвляетсяПродолжениемБолезни,
	|		ЕСТЬNULL(МАКСИМУМ(РасчетныеИКадровыеДанные.ВидПростоя), ВЫБОР
	|				КОГДА РасчетныеИКадровыеДанные.Неявка = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПростояРаботника.ПоНезависящимПричинам)
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ВидПростоя,
	|		РасчетныеИКадровыеДанные.Организация КАК Организация,
	|		РасчетныеИКадровыеДанные.ОрганизацияНаименование КАК ОрганизацияНаименование,
	|		МАКСИМУМ(РасчетныеИКадровыеДанные.РасчетныеДанныеПериодРегистрации) КАК РасчетныеДанныеПериодРегистрации
	|	ИЗ
	|		(ВЫБРАТЬ
	|			КадровыеДанные.Сотрудник КАК Сотрудник,
	|			КадровыеДанные.Сотрудник.Наименование КАК СотрудникНаименование,
	|			КадровыеДанные.Сотрудник.ВидДоговора КАК СотрудникВидДоговора,
	|			КадровыеДанные.Состояние КАК Неявка,
	|			КадровыеДанные.ДатаНачала КАК ДатаНачала,
	|			КадровыеДанные.ФизЛицо КАК КадровыеДанныеФизЛицо,
	|			КадровыеДанные.ДатаОкончания КАК КадровыеДанныеДатаОкончания,
	|			КадровыеДанные.КадровыйДокумент КАК КадровыйДокумент,
	|			КадровыеДанные.ВидДополнительногоОтпуска КАК КадровыеДанныеВидДополнительногоОтпуска,
	|			КадровыеДанные.ДатаНачалаДоп КАК КадровыеДанныеДатаНачалаДоп,
	|			КадровыеДанные.РабочийГодС КАК КадровыеДанныеРабочийГодС,
	|			КадровыеДанные.РабочийГодПо КАК КадровыеДанныеРабочийГодПо,
	|			NULL КАК РасчетныеДанныеФизЛицо,
	|			NULL КАК РасчетныеДанныеДатаОкончания,
	|			NULL КАК РасчетныйДокумент,
	|			NULL КАК РасчетныйДокументПроведен,
	|			NULL КАК ВидРасчета,
	|			NULL КАК ПорядокРасчетаОтпуска,
	|			NULL КАК РасчетныеДанныеВидДополнительногоОтпуска,
	|			NULL КАК РасчетныеДанныеДатаНачалаДоп,
	|			NULL КАК РасчетныеДанныеРабочийГодС,
	|			NULL КАК РасчетныеДанныеРабочийГодПо,
	|			NULL КАК ПричинаНетрудоспособности,
	|			NULL КАК ПроцентОплаты,
	|			NULL КАК ПервичныйБольничныйЛист,
	|			NULL КАК ОграничениеПособия,
	|			NULL КАК СлучайУходаЗаБольнымРебенком,
	|			NULL КАК ДнейОплаты,
	|			NULL КАК ДатаНарушенияРежима,
	|			NULL КАК НомерВходящегоДокумента,
	|			NULL КАК СерияВходящегоДокумента,
	|			КадровыеДанные.ДатаНачала КАК ДатаНачалаСобытия,
	|			КадровыеДанные.ДатаНачала КАК ДатаНачалаОплаты,
	|			NULL КАК ЯвляетсяПродолжениемБолезни,
	|			NULL КАК ВидПростоя,
	|			КадровыеДанные.Организация КАК Организация,
	|			КадровыеДанные.Организация.Наименование КАК ОрганизацияНаименование,
	|			NULL КАК РасчетныеДанныеПериодРегистрации
	|		ИЗ
	|			ВТСостояниеРаботников КАК КадровыеДанные
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			РасчетныеДанные.Сотрудник,
	|			РасчетныеДанные.Сотрудник.Наименование,
	|			РасчетныеДанные.Сотрудник.ВидДоговора,
	|			РасчетныеДанные.Состояние,
	|			РасчетныеДанные.ДатаНачала,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			РасчетныеДанные.Физлицо,
	|			РасчетныеДанные.ДатаОкончания,
	|			РасчетныеДанные.РасчетныйДокумент,
	|			РасчетныеДанные.РасчетныйДокумент.Проведен,
	|			РасчетныеДанные.ВидРасчета,
	|			РасчетныеДанные.ПорядокРасчетаОтпуска,
	|			РасчетныеДанные.ВидДополнительногоОтпуска,
	|			РасчетныеДанные.ДатаНачалаДоп,
	|			РасчетныеДанные.РабочийГодС,
	|			РасчетныеДанные.РабочийГодПо,
	|			РасчетныеДанные.ПричинаНетрудоспособности,
	|			РасчетныеДанные.ПроцентОплаты,
	|			РасчетныеДанные.ПервичныйБольничныйЛист,
	|			РасчетныеДанные.ОграничениеПособия,
	|			РасчетныеДанные.СлучайУходаЗаБольнымРебенком,
	|			РасчетныеДанные.ДнейОплаты,
	|			РасчетныеДанные.ДатаНарушенияРежима,
	|			РасчетныеДанные.НомерВходящегоДокумента,
	|			РасчетныеДанные.СерияВходящегоДокумента,
	|			РасчетныеДанные.ДатаНачалаСобытия,
	|			РасчетныеДанные.ДатаНачалаОплаты,
	|			РасчетныеДанные.ЯвляетсяПродолжениемБолезни,
	|			РасчетныеДанные.ВидПростоя,
	|			РасчетныеДанные.Организация,
	|			РасчетныеДанные.Организация.Наименование,
	|			РасчетныеДанные.ПериодРегистрации
	|		ИЗ
	|			ВТСписокРасчетныхДокументов КАК РасчетныеДанные) КАК РасчетныеИКадровыеДанные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетныеИКадровыеДанные.Сотрудник,
	|		РасчетныеИКадровыеДанные.СотрудникНаименование,
	|		РасчетныеИКадровыеДанные.СотрудникВидДоговора,
	|		РасчетныеИКадровыеДанные.Неявка,
	|		РасчетныеИКадровыеДанные.ДатаНачала,
	|		РасчетныеИКадровыеДанные.ОрганизацияНаименование,
	|		РасчетныеИКадровыеДанные.Организация) КАК РасчетныеИКадровыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеКомандировки КАК ПВРКомандировка
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеУчебногоОтпуска КАК ПВРОтпускУчебный
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеВынужденныйПрогул КАК ПВРВынужденныйПрогул
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеГосударственныеОбязанности КАК ПВРГосударственныеОбязанности
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаОкончания,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТСостояниеРаботников.Сотрудник
	|					ИЗ
	|						ВТСостояниеРаботников КАК ВТСостояниеРаботников
	|				
	|					ОБЪЕДИНИТЬ ВСЕ
	|				
	|					ВЫБРАТЬ
	|						ВТСписокРасчетныхДокументов.Сотрудник
	|					ИЗ
	|						ВТСписокРасчетныхДокументов КАК ВТСписокРасчетныхДокументов)) КАК РаботникиОрганизации
	|		ПО РасчетныеИКадровыеДанные.Сотрудник = РаботникиОрганизации.Сотрудник
	|ГДЕ
	|	РасчетныеИКадровыеДанные.Неявка ЕСТЬ НЕ NULL 
	|	И (&НеОтбиратьПоОрганизации
	|			ИЛИ ВЫБОР
	|				КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаОкончания
	|						И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
	|				ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
	|			КОНЕЦ В (&СписокОрганизаций))
	|	И (&НеОтбиратьПоПодразделению
	|			ИЛИ ВЫБОР
	|				КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаОкончания
	|						И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
	|				ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
	|			КОНЕЦ В ИЕРАРХИИ (&ПодразделениеОрганизации))
	|	И ((НЕ &ОтбиратьСобытияПоДокументу)
	|			ИЛИ РасчетныеИКадровыеДанные.КадровыйДокумент ЕСТЬ НЕ NULL )
	|	И РасчетныеИКадровыеДанные.Отметка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала,
	|	СотрудникНаименование,
	|	Неявка,
	|	КадровыйДокумент,
	|	РасчетныеИКадровыеДанные.РасчетныйДокументПроведен УБЫВ";
	
КонецФункции
